# **MySQL Excercise: world database**

## Import library

## Connect to MySQL

## Tampilkan seluruh table

## Ada berapa negara di database world?

   count(name)
0          239

## Ada berapa negara di Africa?

   count(name)
0           58

## Tampilkan benua dengan jumlah negara lebih dari jumlah negara benua North America

  continent  count(name)
0      Asia           51
1    Africa           58
2    Europe           46

## Tampilkan rata-rata harapan hidup berdasarkan benua

       continent  average_life_expectancy
0  North America                 72.99189
1           Asia                 67.44118
2         Africa                 52.57193
3         Europe                 75.14773
4  South America                 70.94615
5        Oceania                 69.71500
6     Antarctica                      NaN

## Tampilkan Jumlah region di masing-masing benua

       continent  jumlah_region
0           Asia              4
1         Europe              6
2  North America              3
3         Africa              5
4        Oceania              5
5     Antarctica              1
6  South America              1

## Tampilkan rata-rata GNP di Afrika berdasarkan regionnya

            region   average_GNP
0   Central Africa   3659.777778
1   Eastern Africa   3496.250000
2   Western Africa   6277.117647
3  Southern Africa  25386.200000
4  Northern Africa  34838.571429

## Tampilkan negara di Eropa yang memiliki nama dimulai dari huruf I

      name continent
0  Ireland    Europe
1  Iceland    Europe
2    Italy    Europe

## Ada berapa bahasa unik di dunia?

   jumlah_bahasa
0            457

## Tampilkan 10 negara dengan GNP di atas rata-rata GNP negara-negara di benua Oceania, diurutkan dari yang terbesar

           negara        GNP
0   United States  8510700.0
1           Japan  3787042.0
2         Germany  2133367.0
3          France  1424285.0
4  United Kingdom  1378330.0
5           Italy  1161755.0
6           China   982268.0
7          Brazil   776739.0
8          Canada   598862.0
9           Spain   553233.0

## Tampikan GNP negara belanda, ibukota beserta populasi dari ibukotanya

        negara       GNP    capital  population
0  Netherlands  371362.0  Amsterdam    15864000

## 10 negara mana yang memiliki persentase pemakai bahasa spanyol paling tinggi

               negara  persentase
0                Cuba       100.0
1         El Salvador       100.0
2            Colombia        99.0
3  Dominican Republic        98.0
4           Nicaragua        97.6
5          Costa Rica        97.5
6            Honduras        97.2
7           Venezuela        96.9
8           Argentina        96.8
9             Uruguay        95.7

## Tampikan GNP negara Indonesia, ibukota, populasi dari ibukotanya dan bahasa resmi yang dipakai

      negara      GNP ibu_kota  populasi language
0  Indonesia  84982.0  Jakarta   9604900    Malay